[
  {
    "id": "1",
    "title": "ポートフォリオサイトの改良",
    "date": "2025-09-17",
    "tags": ["ポートフォリオ", "ウェブ開発", "HTML", "CSS", "JavaScript"],
    "content": "<h3>なぜ今、アップデートしようと思ったのか？</h3><p>8月にある企業のインターンシップにエントリーする際に、「ご自身のポートフォリオなどがあれば教えてください」という項目があり、1年次に情報処理実習Bという授業で作成したポートフォリオサイトがあることを思いだし、GitHubにて公開し、そのURLを提出しました。</p><p>しかし、提出するまでに時間が取れず、情報の更新ができていなかったので、せっかくの機会なのに今の自分を伝えきれていない、という悔しさを感じました。この経験から、今後もこのようにポートフォリオを求められた際や、ほかの学生からどのようなことを学んでいるのかを尋ねられた際に備えて、わかりやすく自分を伝えるための一つの手法としてポートフォリオサイトを改善させてみたいと思うようになりました。</p><h3>アップデートの工夫：特にこだわったポイント</h3><p>今回最もこだわったのは、新たに<strong>「ブログ機能」を追加したこと</strong>です。当初はWordPressやフレームワークも検討しましたが、あえてHTML・CSS・JavaScriptだけで完結させました。理由は、<strong>「シンプルな構成で、自分の力だけでどこまでできるか試したい」</strong>と思ったからです。</p><p>記事一覧をJSON形式で管理し、JavaScriptで動的に読み込む仕組みを導入しました。これにより、新しい記事の追加もJSONファイルを更新するだけで完結します。さらに、フィルターや検索機能も実装して、使いやすさにも配慮しました。地道な作業でしたが、1つずつ問題を解決する中でJavaScriptの理解が深まり、大きな達成感を得ました。</p><h3>今後の展望</h3><p>ブログを書くことで、自分の考えを言語化する練習になり、知識を整理する習慣もつきそうだと感じました。今回は基本的な技術だけで作りましたが、AIから提案されたフレームワークや効率的な開発手法にも挑戦し、今後さらに改善・拡張していきたいと思います。</p>"
  },
  {
    "id": "2",
    "title": "5日間のインターンに参加して感じた、リアルな学び",
    "date": "2025-09-05",
    "tags": ["チーム開発", "インターンシップ", "スクラム", "ビジネス視点", "Python", "Docker"],
    "content": "<h3>インターンに参加したきっかけ</h3><p>夏休みを利用して、IT業界のエンジニアリングの分野で将来の進路を考えるため、このインターンに参加いたしました。特に<strong>「ビジネス視点とエンジニアリングの両方を経験できる」</strong>というカリキュラムに魅力を感じました。企画から開発、実装までチーム開発の流れを体験することで、<strong>「実際に現場で求められるスキルや進め方」</strong>を体得したいと考えたのが大きなきっかけです。</p><h3>インターンの概要</h3><p>今回参加したのは、ITサービス関連の企業が実施していた5日間のチーム開発コースで、形式は対面でした。プログラムの核は、顧客データや経営データをもとにビジネス上の課題を抽出し、それを解決するWebサイトやツールの開発にチームで取り組むというものでした。開発手法として<strong>「スクラム開発」</strong>を実践的に学びながら進める、非常に実践的な内容でした。事前にDocker、Git、AWS CLIの環境構築やスクラムガイドの確認が必須となっており、初日からスムーズに開発に入れるよう準備する必要がありました。また、PythonやFlaskといった技術知識も任意で準備を推奨されており、学びの意識が高い参加者が集まっていたように思います。</p><h3>印象に残ったこと・気づき</h3><p>何よりも印象的だったのは、<strong>「スクラム開発」</strong>という開発手法を体感できたことです。日々の進捗確認やフィードバックを通じて、短期間で品質を上げていくことの難しさと、チームメンバーとの密な連携の重要性を痛感いたしました。また、テーマ設定に実際のビジネスデータを用いることで、「技術は課題解決の手段である」という<strong>ビジネス視点の重要性</strong>を強く認識しました。「企画」のフェーズがいかに開発全体の成否を握るのか、時間をかけて議論する必要があることを学びました。個人の振り返りとしては、事前にDockerの環境構築で手間取ったことや、Python/Flaskの事前学習があっても、実際の開発スピードについていくのに苦労した点などが強く記憶に残っています。一方で、チームメンバーと協力し、一つのサービスを作り上げたときの達成感は、学生生活ではなかなか得られないものでした。</p><h3>学んだこと・今後にどう活かすか</h3><p>このインターンを通して、エンジニアにとって最も大切なのは、与えられた課題をただ解決するのではなく、課題の背景にある「目的」や「顧客のニーズ」を深く理解することだと学びました。これは今後のキャリアを考える上で非常に重要な視点です。技術面では、チームでの開発環境構築やGitを通じたコードの管理など、これまで個人開発では経験してこなかった実務的なスキルに触れることができました。今後の課題として、限られた時間の中で迅速に機能実装するための技術力と、チーム内で自分の考えを正確かつ簡潔に伝えるコミュニケーション能力を、意識的に磨いていく必要があると痛感しています。</p><h3>その他の備忘録（環境構築・事前準備について）</h3><ul><li>Dockerのインストールと動作確認に想定以上に時間がかかったので、今後はもっと余裕をもって取り組むべきだった。</li><li>スクラムガイドを事前に読んでいたおかげで、ディスカッションの前提知識は持てたが、実践での応用は難しかった。</li><li>対面実施だったため、メンバーの熱意を直接感じることができ、モチベーションを高く保てました。</li></ul><h3>まとめ</h3><p>5日間の短期集中型インターンでしたが、企画、開発、実装、スクラムという開発手法を一気通貫で体験できた、非常に密度の濃い期間でした。この経験は、私がエンジニアとして働くことのリアルを知り、今後どのような知識・スキルを補強すべきかを明確にする上で、何物にも代えがたい財産となりました。この記録を今後の就職活動や自己成長に活かしていきます。</p>"
  },
  {
    "id": "3",
    "title": "1day仕事体験で感じた、IT業界への具体的なイメージ",
    "date": "2025-08-08",
    "tags": ["就職活動", "IT業界", "提案力", "インターンシップ"],
    "content": "<h3>企業説明会（1day仕事体験）に参加した理由</h3><p>就職活動を始めるにあたって、IT業界が実際にどんな業界なのか、そして自分がその中でどのように貢献できるのかを知りたいと思い参加いたしました。特に、業界研究と提案・分析というテーマに関心があったため、具体的なイメージを得る良い機会だと考えました。</p><h3>企業説明会（1day仕事体験）の概要</h3><p>今回参加させていただきましたのは、IT業界の企業が実施されていた1dayの仕事体験です。形式は対面でした。プログラムは、業界研究と提案・分析を学ぶことに主眼が置かれており、企業の事業内容やビジョンに触れるだけでなく、実際にITの仕事で求められる考え方に触れることができました。</p><h3>印象に残った内容</h3><p>最も印象に残ったのは、IT業界の仕事の流れや、<strong>「提案力」の重要性</strong>を学べたことです。単なる技術的な話ではなく、お客様の課題をどのように発見し、それに対してどのような解決策を組み立てていくかという、ビジネスの側面が強調されていた点です。これは、私が漠然と考えていたITの仕事のイメージを大きく変えるきっかけとなりました。</p><h3>参加して得たこと・気づき</h3><p>この1day仕事体験に参加し、IT業界の仕事は技術力だけでなく、<strong>コミュニケーション能力や課題解決能力が非常に重要</strong>であるということを改めて認識いたしました。特に、提案や分析を実際に体験したことで、今の自分に足りないスキルや視点が明確になりました。</p><h3>今後の就職活動への活かし方</h3><p>今回体験して足りないと感じた「提案・分析力」をどう補うか、具体的な計画を立てて取り組む必要があると感じました。他のIT企業の説明会や仕事体験にも積極的に参加し、今日感じたことを比較して見たいと思います。企業の方の考え方を参考に、今後の面接やESでの自己表現に活かしていきたいです。</p><h3>まとめ</h3><p>1dayの仕事体験は、業界や企業に対する漠然としたイメージを、具体的な「仕事の楽しさ・難しさ」へと変える貴重な機会となりました。</p>"
  }
]
